# ClipPlane Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClipPlane Class
Members See Also
---
A set of parameters representing a clip plane in DirectContext3D.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class ClipPlane : IDisposable
```

Visual Basic
---
```text
Public Class ClipPlane _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ClipPlane : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..ClipPlane
# See Also
ClipPlane Members
Autodesk.Revit.DB.DirectContext3D Namespace